{
"personal":{
    "name": "Jose Ramirez",
    "occupation":"Software Enginner",
    "email":"joseinformatico2015@gmail.com",
    "phone":"+56 973924567",
    "location": "Santiago, Chile",
    "linkedin":"/in/jose-ramirez-engineer",
    "relationship":"Single",
    "birth":"07-03-1985"
},
"education":[
    {
        "degree":"Software Engineer",
        "institution":"Universidad Tecnológica Metropolitana","location":"Santiago, Chile 2017"
    },
    {
        "degree":"Bachelor of Science in Engineering",
        "institution":"Universidad Tecnológica Metropolitana", "location":"Santiago, Chile 2015"
    }
],
"certificates":[
    {
        "certification":"IBM Data Science Professional",
        "institution":"Coursera",
        "credential":"https://www.coursera.org/account/accomplishments/verify/75PANZF3N8M8",
        "credential_code":"75PANZF3N8M8"
    },
    {
        "certification":"Spring Boot Framework+ Restful",
        "institution":"Udemy",
        "credential":"https://www.udemy.com/certificate/UC-2VDMG42C",
        "credential_code":"UC-2VDMG42C"
    },
    {
        "certification":"IBM Data Analysis with Python",
        "institution":"IBM",
        "credential":"https://www.coursera.org/account/accomplishments/certificate/S6T8T38M8JAH",
        "credential_code":"S6T8T38M8JAH"
    },
    {
        "certification":"Machine Learning with Python",
        "institution":"Coursera",
        "credential":"https://www.coursera.org/account/accomplishments/verify/75PANZF3N8M8",
        "credential_code":"75PANZF3N8M8"
    },
    {
        "certification":"Skills Framework Information",
        "institution":"SFIA Foundation",
        "credential":"2D51B9A5-9F4F-4489-89AB-CD19F2FA43B4",
        "credential_code":"CD19F2FA43B4"
    },
    {
        "certification":"B1 English Cert",
        "institution":"Antofagasta University",
        "credential":"Digital Diploma https://bit.ly/B1WEEK28",
        "credential_code":"B1WEEK28"
    }
],
"lenguages":{
    "spanish":{},
    "english":[
        {
            "lenguage":"Spanish",
            "level":"Native"
        },
        {
            "lenguage":"English",
            "level":"B2 / IELTS 5.5"
        }
    ]
},
"summary":{
    "spanish":"Ingeniero de Software con mas de 8 años de experiencia como desarrollador full-stack en multiples lenguajes y tecnologias (JAVA, LARAVEL, C++, ANGULAR, REACT, HTML, CSS, SQL, MONGO DB, GIT, JENKINS, AWS, GCP). Como desarrollador he trabajado en multiples tipos de projectos (Bancos, Retail, Proyectos en la nube, Manejo de data corporativa). A traves de los años tambien he tenido la oportunidad de trabajar y explorar diferentes roles TI como SRE, Tech Lead, Instructor de codigo. Gracias a estas experiencias he podido ganar conocimiento que me a permitido alcanzar un mejor entendimiento de cada uno de los procesos involucrados en el desarrollo de software.",
    "english":"Software Engineer with 8+ experience as full stack developer in multiple language and technologies (JAVA, LARAVEL, C++, ANGULAR, REACT, HTML, CSS, SQL, MONGO DB, GIT, JENKINS, AWS, GCP). In my path as a developer, I have had the opportunity to work in multiple kinds of projects (BANKS, RETAIL, CLOUD PROYECTS, ENTERPRISE DATA MANAGEMENT). Over the years I have also been able to work and explore different IT roles such as SRE, Technical Lead and CODE TEACHER. Thanks to these experiences I have gained knowledge that has allowed me to achieve a better understanding of each of the processes involved in software development."
},
"experiences":[
    {
        "spanish":{
            "role":"DESARROLLADOR SENIOR FRONTEND ANGULAR",
            "company":"BANCO BCI / Santiago, Chile / Agosto 2023 – Febrero 2024",
            "activities":[
                {
                    "activity":"Mi principal labor en este role fue implementar 'mejoras evolutivas' a la aplicacion web Portal-Pyme-BCI (clientes pequeña y medianas empresas del banco BCI), los requerimientos solicitados desde el area comercial del banco, eran discutidos junto al equipo y generabamos las historias de usuario que serian agregadas al backlog de JIRA se trabajaban el las tareas en el transcurso del sprint"
                },
                {
                    "activity":"Como desarrollador tenia un segundo labor con este equipo, el cual era el manejo y control de cada etapa del CI/CD (integracion continua), desde el testing hasta el deploy en QA y PROD"
                }
            ]
        },
        "english":{
            "role":"SENIOR FRONTEND ANGULAR DEVELOPER",
            "company":"BCI BANK / Santiago, Chile / August 2023 – February 2024",
            "activities":
            [
                {
                    "activity":"My principal labor in this role was implemented evolutionary improvements to the web app BCI-PYME-PORTAL (medium and small business accounts in BCI bank), all change requested come from the commercial section of the bank and me and my team have to discuss and create user stories and added to Jira backlog to work in them in the sprint duration"
                },
                {
                    "activity":"As a developer I have a secondary labor with this team, that was manage and control every step in the CI/CD (continue integration), from testing until deploy in QA and PROD stage."
                }
            ],
            "stack":"ANGULAR 14, JAVA SPRING BOOT, GIT, CSS, JAVASCRIPT, JIRA, JENKINS, GCP"
        }
    },
    {
        "spanish":{
            "role":"DESARROLLADOR SENIOR FULL-STACK",
            "company":"EQUIFAX / Santiago, Chile / Noviembre 2021 – Junio 2023",
            "activities":
            [
                {
                    "activity":"La mision de mi equipo era crear y mantener la aplicacion web 'Data Tool / Data Maintenance' esta es una plataforma unificada de consultas financieras, implementada para toda LATAM exepto Brasil, este proyecto tenia multiples peculiaridades entre las que destaco el uso de Spring Boot Webflux como lenguaje BACKEND y el uso del EQUIFAX DATAFABRIC (data warehouse en Cloud GCP) como fuente de datos para el proyecto"
                }
            ]
        },
        "english":{
            "role":"SENIOR FULL-STACK DEVELOPER",
            "company":"EQUIFAX / Santiago, Chile / November 2021 – June 2023",
            "activities":
            [
                {
                    "activity":"The mission of my team was created and maintain the web application 'Data Tool / Data Maintenance' this is a unified financial consultant platform, implemented for all LATAM except Brazil, this project has multiple peculiarities among which I highlight the use of Spring Boot Webflux as language for the BACKEND and the use of EQUIFAX DATAFABRIC (GCP cloud based data warehouse) as data source for the project."
                }
            ],
            "stack":"Spring Boot Java 11, JUnit, WebFlux, Cloud Firestore, Maven, Nexus, Angular 14, Unit Testing I use Jasmine & Karma, TypeScript, Sass, CSS, HTML, Angular Material 8, NPM, GCP, Kubernetes, Github, Jenkins, SonarQube, Fortify, Scrum, Confluence and Jira."
        }
    },
    {
        "spanish":{
            "role":"DESARROLLADOR FULL-STACK",
            "company":"ACIDLABS / Santiago, Chile / Julio 2020 – Octubre 2021",
            "activities":
            [
                {
                    "activity":"Trabajar en AcidLabs fue una fantastica experiencia al ser una 'Fabrica de Codigo' ellos tienen clientes de multiples areas (RETAIL, AEROLINEAS, ECOMMERCE, DATA SCIENCE) y trabajan en distintos tipos de proyectos, en esta empresa tube la oportunidad de colaborar en soluciones de software para estas compañias:"
                },
                {
                    "activity":"- MacOnline (principal reseller Apple en Chile) / Abril 2021 a Octubre 2021. Mis principales responsabilidades en esta empresa fue hacer mantenimiento frontend en su plataforma de ventas web, crear nuevas landing pages, reparar errores heredados en la aplicacion."
                },
                {
                    "activity":"- Salcobrand (cadena de farmacias en Chile) / Diciembre 2020 a Abril 2021. Mi rol en esta compañia fue como desarrollador frontend y consistio en general la version responsive (movil y tablet) de la aplicacion en produccion, en este rol trabaje en colaboracion con el diseñador y los stack holder de la empresa."
                },
                {
                    "activity":"- TINK (marketing B2B - Aplicacion de referenciados presente en toda LATAM)/ Julio 2020 a Noviembre 2020. En esta empresa realice multiples tareas : tome requerimientos directamente del director de la compañia; creacion e implementacion de soluciones en codigo; deploy la solucion en distintos ambientes (DEVELOPMENT-QA-PRODUCTION); generar informes de rendimiento de las maquinas GCP que corren la aplicacion. como se puede ver fue bastante trabajo pero a la vez muy enriquecedor ya que me permitio aprender de nuevas tecnologias como lo fue el uso de LOOPBACK como codigo backend, en esta experiencia tambien fue mi primer acercamiento al manejo de la nube GCP"
                }
            ]
        },
        "english":{
            "role":"FULL-STACK DEVELOPER",
            "company":"ACIDLABS / Santiago, Chile / July 2020 – October 2021",
            "activities":
            [
                {
                    "activity":"This company is a 'Code Fabric' than sell IT service to other business in Chile and LATAM, working in AcidLabs was fantastic experience because they have multiple clients from different areas (RETAIL, AIRLINES, ECOMMERCE, DATA SCIENCE) and they work in different kind of projects, in there I have the opportunity of collaborate in software solutions for these companies:"
                },
                {
                    "activity":"- MacOnline (principal reseller of Apple computers in Chile) / April 2021 to October 2021. My main responsibilities in this company were doing frontend maintenance on their web sales platform, create new landing pages, fix legacy issues present in the application."
                },
                {
                    "activity":"- Salcobrand (biggest drugstore in Chile) / December 2020 to April 2021. My role in this company was as a frontend develop and consist in generate the responsive version (mobile and tabled) of the production app, in this role I worked in collaboration with the designer and stack holders from the company."
                },
                {
                    "activity":"- TINK (marketing B2B - App Referral Program present in all LATAM)/ July 2020 to November 2020. In this company I had to fulfill multiple roles: take the software requirements direct from the director of the company ; create and implement the solution as code; deploy the solution in respective ambient (DEVELOPMENT-QA-PRODUCTION); generate performance report from GCP machines running the project and sending to the client. As you can see, it was an arduous task, but it was very enriching and allowed me to learn about new technologies as LOOPBACK EXPRESS that I used in the development of the backend and also in this experience I had my first approach to GCP."
                }
            ],
            "stack":"Ruby on Rails with SPREE, React 16, ANGULAR 11, ANGULAR JS, CSS, HTML, GIT, JAVASCRIPT, SASS, BOOTSTRAP, ADOBE XD (template design tool), JIRA, LOOPBACK EXPRESS, HTML, JAVASCRIPT, CSS, GIT, GCP"
        }
    },
    {
        "spanish":{
            "role":"DESARROLLADOR FULL-STACK Y LIDER TECNICO LARAVEL",
            "company":"MINISTERIO DE SALUD (SSMOC) / Santiago, Chile / Enero 2019 – Junio 2020",
            "activities":
            [
                {
                    "activity":"Tercera experiencia trabajando en entidad publica Chile, primeros 5 meses en la institucion trabaje como desarrollador PHP y framework LARAVEL, despues mi jefatura basado en mi desempeño y conocimiento, me ofrecio pasar a ser lider tecnico del proyecto. En mi nuevo rol estube a cargo de todas las etapas de desarrollo (requerimientos - desarrolo - test - deploy) y tambien de la organizacion e induccion de los miembros del equipo de trabajo. En mi paso por esta institucion trabaje en variados proyectos de diferente complejidad de los cuales rescato aquellos que tubieron una implementacion a nivel nacional y que representaron un mayor reto."
                },
                {
                    "activity":"- SSMOC-VIH : Sistema para manejo de solicitud y resultados de examenes VIH. Este sistema pone a dispocicion la informacion recolectada en tiempo real para todos los establecimientos que permanescan al servicio publico de salud a lo largo del pais"
                },
                {
                    "activity":"- SSMOC-PRAM : Sistema de reclutamiento de emergencia para profecionales de la salud. Cuando la pandemia COVID comenzo, fue necesario crear un sistema que permitiera encontrar, seleccionar y proponer un profecional a una region especifica del pais que lo requiriera."
                }
            ]
        },
        "english":{
            "role":"FULL-STACK DEVELOPER AND TECHNICAL LEAD LARAVEL",
            "company":"MINISTRY OF HEALTH CHILE (SSMOC) / Santiago, Chile / January 2019 – June 2020",
            "activities":
            [
                {
                    "activity":"This was my second experience working in a public entity in Chile, the first 5 months in this institution I work as a full stack developer using PHP and his framework LARAVEL, after that period my employer based in my knowledge and productivity, offered me the position of technical leader. In my new role I was not only in charge of all stages of software development (requirements - development - testing - deploys) but also of the organization and induction of each member of the human work team. In my period in this institution I worked on several projects with different complexity of which I rescue those  implemented at national level and represented the greatest challenge."
                },
                {
                    "activity":"- SSMOC-VIH : Management and control system for test request and HIV test result, This system makes available the information collected in real time among all establishments who belong to public health service across the country."
                },
                {
                    "activity":"- SSMOC-PRAM : Emergency recruitment system for health professionals. When COVID pandemic began, it was necessary to create a system that would allow find, select and propose a professional to a region of the country that required it."
                }
            ],
            "stack":"LARAVEL 5.8, HTML, CSS, JAVASCRIPT, JQUERY, BOOTSTRAP, AWS, LINUX, JENKINS, ANGULAR, REACT,  PYTHON 3.8, JAVA SPRING BOOT, MYSQL, MONGODB, SCRUM"
        }
    },
    {
        "spanish":{
            "role":"DESARROLLADOR FULL-STACK / JAVA SPRING BOOT - REACT NATIVE",
            "company":"Startup CIENCIA NETA / Mexico DF, Mexico / Mayo 2018 – Noviembre 2018",
            "activities":
            [
                {
                    "activity":"Desarrollador Full Stack para aplicacion 'NoMore' (sistema de informacion y prevencion para seguridad de la mujer) version web / Android / iOS. Prototipo de la aplicacion, desde la idea conceptual del cliente hasta la implementacion de la base de datos y la instalacion del servidor." 
                },
                {
                    "activity":"Construcion de modulos (login, manejo de usuarios, geolocalizacion, foro, noticias, red social), modulos 'alarma preventiva' y 'modulo predictivo' usando Machine Learning "
                }
            ]
        },
        "english":{
            "role":"FULL-STACK DEVELOPER / JAVA SPRING BOOT - REACT NATIVE",
            "company":"Startup CIENCIA NETA / Mexico DF, Mexico / May 2018 – November 2018",
            "activities":[
                {
                    "activity":"Full Stack developer for 'NoMore' application (information and prevention system for women's safety) version web / Android / iOS."
                },
                {
                    "activity":"Development of the prototype app, from the conceptual idea of the client to the database implementation and server installation."
                },
                {
                    "activity":"Construction of general modules (login, user management, geolocation, forum, news, social network), and construction of alarm warning module and predictive module using Machine Learning."
                }
            ],
            "stack":"JAVA SPRING BOOT 2.0.5, REACT NATIVE 0.56, GCP, Kubernetes, Git, HTML, CSS, TOMCAT"
        }
    },
    {
        "spanish":{
            "role":"DESARROLLADOR FULL-STACK / LARAVEL - ANGULAR",
            "company":"Hospital regional de Copiapó (HRC) / Copiapó, Chile / Junio 2017 - Febrero 2018",
            "activities":
            [
                {
                    "activity":"Ingenieria de requerimientos, ordenar y categorizacion de lo requerimientos funcionales y no funcionales, necesarios para el desarrollo del sistema 'Sistema Pagare para el area de contabilidad del HRC'. implementacion de base de datos y servidor SQL. Mantenimiento y deploy del proyecto en los servidores privados PHP del hospital."
                }
            ]
        },
        "english":{
            "role":"FULL-STACK DEVELOPER / LARAVEL - ANGULAR",
            "company":"Copiapó Regional Hospital (HRC) / Copiapó, Chile / June 2017 – February 2018",
            "activities":
            [
                {
                    "activity":"Requirements engineering, ordering and categorization of the functional and non-functional requirements necessary for the development of the 'Payment system for the HRC Accounting area' project."
                },
                {
                    "activity":"Construction of “Sistema Pagare” information system for the commercialization area of the hospital. Implement app code and database server SQL. Deployment and maintenance of project in local hospital servers PHP."
                }
            ],
            "stack":"LARAVEL 6, GIT, LINUX, ANGULAR 7"
        }
    },
    {
        "spanish":{
            "role":"INSTRUCTOR LENGUAJE PROGRAMACION JAVA",
            "company":"SENCE / Copiapó, Chile / Marzo 2017 – Febrero 2018",
            "activities":
            [
                {
                    "activity":"Instructor en curso de programacion '1000 Programadores para Chile', curso introductorio a la programacion. Hice clases teoricas y practicas en areas como logica, matematicas, pseudocodigo, algoritmos, Java, Java EE, Servidores, Git, Javascript, HTML5 / CSS3."
                }
            ]
        },
        "english":{
            "role":"JAVA PROGRAMMING LANGUAGE INSTRUCTOR",
            "company":"SENCE National Training and Employment Service / Copiapó, Chile / March 2017 – February 2018",
            "activities":
            [
                {
                    "activity":"Instructor in the '1000 Programadores para Chile' programming course, introductory course to programming. I do theoretical and practical classes in areas such as logic, mathematics, pseudocode, algorithms, Java, Java EE, Servers, Git, Javascript, HTML5 / CSS3."
                }
            ],
            "stack":"JAVA 8, Javascript, HTML5, CSS3, Eclipse, Visual studio code"
        }
    },
    {
        "spanish":{
            "role":"DESARROLLADOR FULL-STACK / ActionScript - JavaScript",
            "company":"HERPA-MAQUALAS / Chile - Holanda / Octubre 2015 – Enero 2017",
            "activities":
            [
                {
                    "activity":"Creacion de la version prototipo del juego online multijugador (miniaturas de aeropuertos y aviones) basado en la miniaturas reales del catalogo de la compañia HERPA."
                },
                {
                    "activity":"Creacion modulos registro usuario, producto, colecciones, pagos, travels, simulador de trafico del aeropuerto, intefaz mundo 2d usando javascript y THREE.js; Implementacion de base de datos PostgreSQL e instalacion de servidor."
                }
            ]
        },
        "english":{
            "role":"FULL-STACK DEVELOPER / ActionScript - JavaScript",
            "company":"HERPA-MAQUALAS / Chile - Netherlands / October 2015 – January 2017",
            "activities":[
                {
                    "activity":"Creation of prototype version for online multiplayer game (miniature airports and planes) based on the real miniature products of HERPA company catalog."
                },
                {
                    "activity":"Construction of modules for user registration, product registration, collections, payments, travels, implementation of airport traffic simulator, first stage of 2d world in JavaScript an THREE.js; Implementation of the PostgreSQL database and servers."
                }
            ],
            "stack":"Action Script 8, JAVA JSP, TOMCAT, JAVASCRIPT, CSS, SQL, HTML"
        }
    }
],
"references":[
    {
        "name":"Frits de Kleine",
        "role":"CEO / Maquales-Herpa",
        "phone":"+31 68 2400482",
        "email":"s.f.dekleine@tudelft.nl",
        "location":"Netherlands"
    },
    {
        "name":"Bruno Bonomo",
        "role":"Product Owner / Equifax",
        "phone":"+54 011 1523202948",
        "email":"bonomo13@hotmail.com",
        "location":"Argentine"
    },
    {
        "name":"Tomás Said Rosales",
        "role":"Tech Lead / BCI",
        "phone":"+56 98 2213443",
        "email":"tomas.rosales@bci.cl",
        "location":"Chile"
    },
    {
        "name":"Ruben Oropeza",
        "role":"Owner / NoMore App",
        "phone":"+52 22 86030823",
        "email":"ruben.oropeza@cinvestav.mx",
        "location":"Mexico"
    }
],
"ui":{
    "work_experience":{
        "english":"WORK EXPERIENCES",
        "spanish":"EXPERIENCIA LABORAL",
        "chinese":"EXPERIENCIA LABORAL CHINO"
    }
}
}